Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Users can also use a file named `data.sql` in addition to `import.sql`
ja_jp: ユーザーは、 `import.sql` という名前のファイルに加えて `data.sql` を使用することができます

source: Users can even provide their own `ObjectMapper` bean if they so choose. If this is done, it is very important to manually inject and apply all `io.quarkus.jackson.ObjectMapperCustomizer` beans in the CDI producer that produces `ObjectMapper`. Failure to do so will prevent Jackson specific customizations provided by various extensions from being applied.
ja_jp: ユーザーは、選択すれば自分の `ObjectMapper` Beanを提供することもできます。この場合、 `ObjectMapper` を生成する CDI プロデューサの中で、すべての `io.quarkus.jackson.ObjectMapperCustomizer` Bean を手動で注入して適用することが非常に重要です。これを怠ると、様々なエクステンションによって提供される Jackson 固有のカスタマイズが適用されなくなります。

source: Users can even provide their own `ObjectMapper` bean if they so choose. If this is done, it is very important to manually inject and apply all `io.quarkus.jackson.ObjectMapperCustomizer` beans in the CDI producer that produces `ObjectMapper`. Failure to do so will prevent Jackson-specific customizations provided by various extensions from being applied.
ja_jp: ユーザーは、選択すれば自分の `ObjectMapper` Bean を提供することもできます。この場合、 `ObjectMapper` を生成する CDI プロデューサーの中で、すべての `io.quarkus.jackson.ObjectMapperCustomizer` Bean を手動で注入して適用することが非常に重要です。これを怠ると、様々なエクステンションによって提供される Jackson 固有のカスタマイズが適用されなくなります。

source: Users can have a raw view on the storage in the settings page:
ja_jp: ユーザーは設定ページでストレージの生データを確認できます:

source: Users can instruct the container to not remove any of their specific beans (even if they satisfy all the rules specified above) by annotating them with `@io.quarkus.arc.Unremovable`. This annotation can be declared on a class, a producer method or field.
ja_jp: ユーザーは、コンテナーに `@io.quarkus.arc.Unremovable` をアノテーションすることで、(上で指定したルールをすべて満たしていても) 特定の Bean を削除しないように指示することができます。このアノテーションは、クラス、producer メソッド、producer フィールドに置くことができます。

source: Users can request a logout by sending a request to the Quarkus endpoint logout path set with a `quarkus.oidc.logout.path` property. For example, if the endpoint address is `https://application.com/webapp` and the `quarkus.oidc.logout.path` is set to "/logout" then the logout request has to be sent to `https://application.com/webapp/logout`.
ja_jp: ユーザーは、 `quarkus.oidc.logout.path` プロパティーで設定されたQuarkusエンドポイントのログアウトパスにリクエストを送信することで、ログアウトを要求することができます。たとえば、エンドポイントのアドレスが `https://application.com/webapp` で、 `quarkus.oidc.logout.path` が "/logout" に設定されている場合、ログアウト要求は `https://application.com/webapp/logout` に送信されます。

source: Users can request a logout by sending a request to the Quarkus endpoint logout path set with a `quarkus.oidc.logout.path` property. For example, if the endpoint address is `https://application.com/webapp` and the `quarkus.oidc.logout.path` is set to `/logout`, then the logout request must be sent to `https://application.com/webapp/logout`.
ja_jp: ユーザーは、 `quarkus.oidc.logout.path` プロパティーで設定された Quarkus エンドポイントのログアウトパスにリクエストを送信することで、ログアウトをリクエストできます。 たとえば、エンドポイントアドレスが `https://application.com/webapp` で、 `quarkus.oidc.logout.path` が `/logout` に設定されている場合、ログアウトリクエストは `https://application.com/webapp/logout` に送信される必要があります。

source: Users however can opt into interceptors by adding the corresponding annotations to the method.
ja_jp: ただし、ユーザーはメソッドに対応するアノテーションを追加することでインターセプターを選択できます。

source: Users migrating multipart resources to Quarkus REST should be aware of the configuration parameter `quarkus.http.limits.max-form-attribute-size`, as this poses an upper limit to the size of each part. Any request with a part size exceeding this configuration value will result in HTTP status code 413.
ja_jp: マルチパートリソースを Quarkus REST に移行するユーザーは、各パーツのサイズに上限を設定する設定パラメーター `quarkus.http.limits.max-form-attribute-size` に注意する必要があります。 この設定値を超える部分サイズのリクエストには、HTTP ステータスコード 413 が返されます。

source: Users migrating multipart resources to RESTEasy Reactive should be aware of the configuration parameter `quarkus.http.limits.max-form-attribute-size`, as this poses an upper limit to the size of each part. Any request with a part size exceeding this configuration value will result in HTTP status code 413.
ja_jp: multipart リソースを RESTEasy Reactive に移行するユーザーは、設定パラメータ `quarkus.http.limits.max-form-attribute-size` に注意する必要があります。これにより、各パートのサイズに上限が設定されるためです。 この設定値を超えるパーツ サイズのリクエストは、HTTP ステータス コード 413 になります。

source: Users should not be adding the deployment modules of extension as application dependencies. The deployment dependencies are resolved by Quarkus during the augmentation phase from the runtime dependencies of the application.
ja_jp: ユーザーは、エクステンションのデプロイメントモジュールをアプリケーションの依存関係として追加すべきではありません。デプロイメントの依存関係は、拡張フェーズの間に Quarkus によってアプリケーションの実行時依存関係から解決されます。

source: Users won't be using an image registry and will instead make their container image accessible to the Kubernetes cluster by building it directly into Minikube's Docker daemon. To use Minikube's Docker daemon you must first execute:
ja_jp: ユーザーはイメージレジストリを使用せず、コンテナーイメージをMinikubeのDockerデーモンに直接ビルドしてKubernetesクラスタにアクセスできるようにします。MinikubeのDockerデーモンを使用するには、まず実行する必要があります。

source: Uses GraalVM 21.+
ja_jp: GraalVM 21.+ を使用している

source: Uses the JBang binary. If missing, it will be automatically installed under `.jbang`.
ja_jp: JBangバイナリを使用します。もし見つからない場合、自動的に `.jbang` にインストールされます。

source: Using
ja_jp: 使用

source: Using @ApplicationScoped Beans as Verticle
ja_jp: Verticleとしての@ApplicationScoped Beansの使用

source: Using @Authenticated
ja_jp: `@Authenticated` の使用

source: Using @Blocking annotation in exception mappers
ja_jp: 例外マッパーでの@Blockingアノテーションの使用

source: Using @ClientExceptionMapper
ja_jp: @ClientExceptionMapper を使用する

source: Using @ClientFormParam
ja_jp: @ClientFormParamの使用

source: Using @ClientQueryParam
ja_jp: @ClientQueryParam を使用

source: Using @QuarkusIntegrationTest
ja_jp: @QuarkusIntegrationTest の利用

source: Using AI to optimize a schedule with OptaPlanner
ja_jp: OptaPlannerでAIを使ってスケジュールを最適化する

source: Using AMQP with Reactive Messaging
ja_jp: リアクティブメッセージングでのAMQPの使用

source: Using Apache Kafka Streams
ja_jp: Apache Kafka ストリームの使用

source: Using Apache Kafka with Schema Registry and Avro
ja_jp: Schema RegistryとAvroと共にApache Kafkaを使用

source: Using Apache Kafka with Schema Registry and JSON Schema
ja_jp: スキーマレジストリとJSONスキーマと共にApache Kafkaを使用する

source: Using Avro in a native executable
ja_jp: Avro をネイティブ実行可能ファイルで使用する

source: Using Bean Validation
ja_jp: Bean バリデーションの使用

source: Using Blaze-Persistence
ja_jp: Blaze-Persistenceの使用

source: Using Build time conditions
ja_jp: ビルドタイム条件の使用

source: Using CDI BeanContainer Interface
ja_jp: CDI BeanContainer インターフェイスの使用

source: Using CDI beans
ja_jp: CDI Bean の使用

source: Using CDI beans as extension points: selecting the persistence layer
ja_jp: CDI Bean を拡張点として使用する: 永続化層の選択

source: Using CDI to produce a test exporter
ja_jp: テストエクスポーターを生成するための CDI の使用

source: Using CI Environments
ja_jp: CI 環境の利用

source: Using ClientMultipartForm
ja_jp: ClientMultipartForm の使用

source: Using Cloud SQL
ja_jp: Cloud SQLの使用

source: Using Cloud SQL with a JDBC driver
ja_jp: JDBCドライバーでのCloud SQLの使用

source: Using Cloud SQL with a reactive SQL client
ja_jp: リアクティブSQLクライアントでのCloud SQLの使用

source: Using Cloud SQL with native executables
ja_jp: ネイティブ実行可能ファイルでのCloud SQLの使用

source: Using Compose Dev Services
ja_jp: Compose Dev Services の使用

source: Using Compose profiles
ja_jp: Compose プロファイルの使用

source: Using Credentials Provider
ja_jp: クレデンシャルプロバイダーの使用

source: Using DMN decision tables
ja_jp: DMN のディシジョンテーブルの使用

source: Using Deployment instead of DeploymentConfig
ja_jp: DeploymentConfigの代わりにDeploymentを使用

source: Using Dev Services
ja_jp: Dev Servicesの利用

source: Using Docker
ja_jp: Dockerの使用

source: Using Eclipse Vert.x API from a Quarkus Application
ja_jp: QuarkusアプリケーションからのEclipse Vert.x APIの使用

source: Using Fault Tolerance
ja_jp: フォールトトレランスの使用

source: Using Flyway
ja_jp: Flywayの使用

source: Using Gizmo
ja_jp: Gizmo の使用

source: Using Gradle
ja_jp: Gradleの使用

source: Using HTTP with Reactive Messaging
ja_jp: リアクティブメッセージングでの HTTP の利用

source: Using HTTPS or SSL/TLS
ja_jp: HTTPS または SSL/TLS の使用

source: Using HashiCorp Vault with Databases
ja_jp: HashiCorp Vaultをデータベースで使用

source: Using HashiCorp Vault’s PKI Secret Engine
ja_jp: HashiCorp Vault’s PKI Secret Engineの使用

source: Using Health Check
ja_jp: ヘルスチェックの使用

source: Using Hibernate ORM and JPA
ja_jp: Hibernate ORMとJPAの使用

source: Using Hibernate ORM and Jakarta Persistence
ja_jp: Hibernate ORMとJakarta Persistenceの使用

source: Using Hibernate Reactive
ja_jp: Hibernate Reactiveの使用

source: Using Hibernate Reactive in a `@QuarkusTest` is slightly more involved than using Hibernate ORM due to the asynchronous nature of the APIs and the fact that all operations need to run on a Vert.x Event Loop.
ja_jp: `@QuarkusTest` で Hibernate Reactive を使用する場合、API の非同期性とすべての操作を Vert.x イベントループで実行する必要から、Hibernate ORM を使用するより少し複雑です。

source: Using Hibernate Reactive with Panache to interact with a database in a reactive fashion
ja_jp: Hibernate Reactive with Panacheによるリアクティブなデータベースとの連携

source: Using Hibernate Search annotations
ja_jp: Hibernate Searchアノテーションの使用

source: Using Infinispan Client
ja_jp: Infinispanクライアントの使用

source: Using JBang aliases
ja_jp: JBangのエイリアスの使用

source: Using JDK Flight Recorder
ja_jp: JDK Flight Recorder を使う

source: Using JMS
ja_jp: JMSの使用

source: Using JWT RBAC
ja_jp: JWT RBAC の使用

source: Using Java Flight Recorder
ja_jp: Java Flight Recorder の使用

source: Using Keycloak Admin Client
ja_jp: Keycloak Admin Clientの使用

source: Using Keycloak to centralize authorization
ja_jp: Keycloak を使用した認可の一元化

source: Using KeycloakTestResourceLifecycleManager
ja_jp: KeecycloakTestResourceLifecycleManager の使用

source: Using Kogito DMN support to add decision automation capabilities to an application
ja_jp: アプリケーションにディシジョン・オートメーション機能を追加するためのKogito DMNサポートの使用

source: Using Kogito to add business automation capabilities to an application
ja_jp: Kogito を使用してアプリケーションにビジネスオートメーションの機能を追加する

source: Using Kogito to add prediction capabilities to an application
ja_jp: Kogito を使用してアプリケーションに予測機能を追加する

source: Using Kogito to add rule engine capabilities to an application
ja_jp: Kogito を使用してアプリケーションにルールエンジン機能を追加します。

source: Using Kotlin
ja_jp: Kotlinの使用

source: Using Kubernetes secrets
ja_jp: Kubernetes シークレットの使用

source: Using Kubernetes secrets or cert-manager
ja_jp: Kubernetes シークレットまたは cert-manager の使用

source: Using LRA (Long Running Actions)
ja_jp: LRA（Long Running Actions）の活用

source: Using Liquibase
ja_jp: Liquibaseの使用

source: Using Liquibase MongoDB
ja_jp: Liquibase MongoDBの使用

source: Using Maven
ja_jp: Maven の使用

source: Using Maven, add the BOM and dependencies:
ja_jp: Maven を使用して、BOM と依存関係を追加します。

source: Using MeterFilter to configure metrics
ja_jp: MeterFilter を使ってメトリクスを設定する

source: Using Monitoring Options
ja_jp: 監視オプションの使用

source: Using Multiple Outgoings can be useful for implementing fan-out patterns, in which a single message is processed by multiple target channels.
ja_jp: Multiple Outgoings を使用すると、単一のメッセージが複数のターゲットチャネルによって処理されるファンアウトパターンを実装する場合に役立ちます。

source: Using Mutiny, you can implement these as follows:
ja_jp: Mutinyを使うと、以下のように実装できます。

source: Using OAuth2 RBAC
ja_jp: OAuth2 RBACの使用

source: Using OpenAPI and Swagger UI
ja_jp: OpenAPIとSwagger UIの利用

source: Using OpenID Connect (OIDC) Multi-Tenancy
ja_jp: OpenID Connect (OIDC) マルチテナンシーの使用

source: Using OpenID Connect (OIDC) and Keycloak to Centralize Authorization
ja_jp: OpenID Connect（OIDC）とKeycloakを使った認可の中央管理

source: Using OpenID Connect (OIDC) and Keycloak to Centralize Authorizations
ja_jp: OpenID Connect (OIDC) とKeycloakを使用した権限の一元化

source: Using OpenID Connect (OIDC) and Keycloak to centralize authorization
ja_jp: OpenID Connect (OIDC)とKeycloakを使用した認可の一元化

source: Using OpenID Connect (OIDC) and OAuth2 Client and Filters
ja_jp: OpenID Connect (OIDC) と OAuth2 クライアント、フィルタの使用

source: Using OpenID Connect (OIDC) and OAuth2 Client and Filters to manage access tokens
ja_jp: OpenID Connect (OIDC)、OAuth2 クライアントおよびフィルターを使用したアクセストークンの管理

source: Using OpenID Connect (OIDC) multitenancy
ja_jp: OpenID Connect (OIDC)のマルチテナンシーの使用

source: Using OpenID Connect (OIDC) to Protect Service Applications
ja_jp: OpenID Connect (OIDC) を使用したサービスアプリケーションの保護

source: Using OpenID Connect (OIDC) to Protect Service Applications using Bearer Token Authorization
ja_jp: OpenID Connect (OIDC) を使用したBearer Token認可によるサービスアプリケーションの保護

source: Using OpenID Connect (OIDC) to Protect Web Applications
ja_jp: OpenID Connect (OIDC) を使用した Web アプリケーションの保護

source: Using OpenID Connect (OIDC) to Protect Web Applications using Authorization Code Flow
ja_jp: OpenID Connect (OIDC)を使用した認可コードフローによるWebアプリケーションの保護

source: Using OpenTelemetry
ja_jp: OpenTelemetryの使用

source: Using OpenTelemetry Logging
ja_jp: OpenTelemetry Loggingの使用

source: Using OpenTelemetry Metrics
ja_jp: OpenTelemetry Metricsの使用

source: Using OpenTelemetry Tracing
ja_jp: OpenTelemetry Tracing の使用

source: Using OpenTracing
ja_jp: OpenTracingの使用

source: Using Panache entities
ja_jp: Panache エンティティーの使用

source: Using Podman
ja_jp: Podmanの使用

source: Using Podman with Quarkus
ja_jp: Podman と Quarkus の併用

source: Using Property Expressions
ja_jp: プロパティー式の使用

source: Using Proxy Registry
ja_jp: プロキシーレジストリーの使用

source: Using Quarkus CLI
ja_jp: Quarkus CLIの使用

source: Using Quarkus REST
ja_jp: Quarkus REST の使用

source: Using Quarkus REST (formerly RESTEasy Reactive) to implement HTTP API while enforcing the reactive principle
ja_jp: Quarkus REST（旧RESTEasy Reactive）を使用して、リアクティブ原則に基づいてHTTP APIを実装します。

source: Using Quarkus REST and Hibernate ORM with Panache, the code would be something like:
ja_jp: Quarkus REST と Hibernate ORM with Panache を使用すると、コードは次のようになります。

source: Using Quinoa to plug npm-compatible web applications
ja_jp: Quinoa を使用して npm 互換のウェブアプリケーションをプラグインする

source: Using Qute
ja_jp: Qute の使用

source: Using RESTEasy Reactive to implement HTTP API while enforcing the reactive principle
ja_jp: RESTEasy Reactiveを使用して、リアクティブの原則を実行しながらHTTP APIを実装

source: Using RESTEasy Reactive, it is now possible to filter the JSON output based on the role of the user using the `@SecureField` annotation:
ja_jp: RESTEasy Reactiveを使用している場合、 `@SecureField` アノテーションを使用して、ユーザーの役割に基づいてJSON出力をフィルタリングできるようになりました。

source: Using RESTEasy _reactive_ does not change the _hello_ example from above:
ja_jp: RESTEasy _reactive_ を使用しても、上記の _hello_ の例は変わりません。

source: Using RabbitMQ
ja_jp: RabbitMQ の使用

source: Using RabbitMQ with Reactive Messaging
ja_jp: リアクティブメッセージングでのRabbitMQの使用

source: Using Reactive Routes
ja_jp: Reactive Routesの使用

source: Using RedirectException
ja_jp: RedirectExceptionの使用

source: Using Response
ja_jp: Response の利用

source: Using RestResponse
ja_jp: RestResponseの使用

source: Using S2I to deploy Quarkus applications to OpenShift
ja_jp: S2Iを使用したQuarkusアプリケーションのOpenShiftへのデプロイ

source: Using SSL With Native Executables
ja_jp: ネイティブイメージでのSSLの利用

source: Using SSL with native executables
ja_jp: ネイティブ実行可能ファイルでのSSLの使用

source: Using Schema Registry
ja_jp: スキーマレジストリーの使用

source: Using Security with .properties File
ja_jp: .propertiesファイルと共にSecurityを使用

source: Using Security with JDBC
ja_jp: JDBCと共にSecurityを使用

source: Using Security with JPA
ja_jp: JPAと共にSecurityを使用

source: Using Security with LDAP
ja_jp: LDAPと共にSecurityを使用

source: Using Security with WebAuthn
ja_jp: Quarkus SecurityでWebAuthnを使用

source: Using Security with an LDAP Realm
ja_jp: LDAPレルムを利用したセキュリティーの使用

source: Using Sentry to Monitor your Logs
ja_jp: Sentryを使ってログを監視する

source: Using Snappy for message compression
ja_jp: メッセージ圧縮での Snappy の使用

source: Using Software Transactional Memory
ja_jp: ソフトウェア・トランザクション・メモリの使用

source: Using Software Transactional Memory in Quarkus
ja_jp: Quarkus でのソフトウェアトランザクショナルメモリーの使用

source: Using Spies instead of Mocks with `@InjectSpy`
ja_jp: `@InjectSpy` で、モックの代わりにスパイを使用する

source: Using Spring Boot's ConfigurationProperties
ja_jp: Spring BootのConfigurationPropertiesの使用

source: Using Start/Stop Controls
ja_jp: 起動/停止コントロールの使用

source: Using Stork in Kubernetes
ja_jp: KubernetesでのStorkの使用

source: Using Stork with Kubernetes
ja_jp: Kubernetes で Stork を使用

source: Using Swagger UI
ja_jp: Swagger UIの使用

source: Using Test Scenario tool
ja_jp: テストシナリオツールの使用

source: Using Thread's Context Class Loader
ja_jp: スレッドコンテキストクラスローダーの使用

source: Using Transactions
ja_jp: トランザクションの使用

source: Using Transactions in Quarkus
ja_jp: Quarkusでのトランザクションの使用

source: Using Unix Socket
ja_jp: Unix ソケットの使用

source: Using Vaadin UI components for rendering
ja_jp: レンダリングに Vaadin UI コンポーネントを使用する

source: Using Vault
ja_jp: Vaultの使用

source: Using Vault Transit Secret Engine
ja_jp: ヴォールトトランジットシークレットエンジンの使用

source: Using Vert.x
ja_jp: Vert.xの使用

source: Using Vert.x Clients
ja_jp: Vert.x クライアントの使用

source: Using Vert.x Core API
ja_jp: Vert.x Core APIの使用

source: Using Vert.x JSON
ja_jp: Vert.x JSONの使用

source: Using Vert.x clients
ja_jp: Vert.xクライアントの使用

source: Using Vert.x stream capability
ja_jp: Vert.x stream の能力の使用

source: Using WebSockets
ja_jp: WebSocketの使用

source: Using WebSockets with Reactive Messaging
ja_jp: WebSocketとReactive Messagingの併用

source: Using WebSockets with Undertow
ja_jp: Undertow との WebSockets の使用

source: Using XA, a rollback in one datasource will trigger a rollback in every other datasource enrolled in the transaction.
ja_jp: XA を使用すると、1 つのデータソースでのロールバックにより、トランザクションに登録されている他のすべてのデータソースでのロールバックがトリガーされます。

source: Using `@BsonProperty` is not needed to define custom column mappings, as the mappings from the entity class will be used.
ja_jp: エンティティクラスのマッピングが使用されるため、カスタムカラムマッピングを定義するために `@BsonProperty` を使用する必要はありません。

source: Using `@ConfigProperty("quarkus.profile")` will *not* work properly.
ja_jp: `@ConfigProperty("quarkus.profile")` を使用すると正常に**動作しません**。

source: Using `@DisabledOnIntegrationTest` will also disable the test in all integration test instances, including testing the application in JVM mode, in a container image, and native image.
ja_jp: `@DisabledOnIntegrationTest` を使用すると、JVM モード、コンテナーイメージ、ネイティブイメージでのアプリケーションのテストを含む、すべての統合テストインスタンスでのテストも無効になります。

source: Using `@InjectMock` with `@RestClient`
ja_jp: `@InjectMock` との併用 `@RestClient`

source: Using `@InjectMock`, the previous example could be written as follows:
ja_jp: `@InjectMock` を使用すると、先ほどの例は次のように書くことができます:

source: Using `@Inject` will get you a CDI proxy to the mock instance you install, which is not suitable for passing to methods such as `Mockito.verify` which want the mock instance itself. So if you need to call methods such as `verify` you should hang on to the mock instance in your test, or use `@io.quarkus.test.InjectMock`.
ja_jp: `@Inject` を使用すると、インストールしたモックインスタンスへの CDI プロキシーが取得されますが、これは `Mockito.verify` などのメソッドに渡すのには適していません。 これらのメソッドはモックインスタンスそのものを要求するためです。 したがって、 `verify` などのメソッドを呼び出す必要がある場合は、テストでモックインスタンスを保持するか、 `@io.quarkus.test.InjectMock` を使用する必要があります。

source: Using `@Inject` will get you a CDI proxy to the mock instance you install, which is not suitable for passing to methods such as `Mockito.verify` which want the mock instance itself. So if you need to call methods such as `verify` you need to hang on to the mock instance in your test, or use `@InjectMock` as shown below.
ja_jp: `@Inject` を使用すると、インストールしたモックインスタンスへの CDI プロキシーを取得できます。これは、モックインスタンス自体が必要な `Mockito.verify` などのメソッドに渡すのには適していません。したがって、 `verify` などのメソッドを呼び出す必要がある場合は、テストでモックインスタンスを保持するか、以下のように `@InjectMock` を使用する必要があります。

source: Using `@PermitAll` will not open a path if the path is restricted by the `quarkus.http.auth.` configuration. To ensure specific paths are accessible, appropriate configurations must be made within the Quarkus security settings.
ja_jp: `quarkus.http.auth.` 設定によってパスが制限されている場合、 `@PermitAll` を使用してもパスは開きません。 特定のパスにアクセスできるようにするには、Quarkus のセキュリティー設定内で適切な設定を行う必要があります。

source: Using `@QuarkusIntegrationTest`
ja_jp: `@QuarkusIntegrationTest` の使用

source: Using `@ShutdownDelayInitiated` to execute a business method of a CDI bean when Quarkus shutdown delay initiates
ja_jp: `@ShutdownDelayInitiated` を使用した Quarkus シャットダウン遅延開始時の CDI Bean のビジネスメソッド実行

source: Using `@Shutdown` to execute a business method of a CDI bean during application shutdown
ja_jp: `@Shutdown` を使用して、アプリケーションのシャットダウン中に CDI Bean のビジネスメソッドを実行します。

source: Using `@Startup` to initialize a CDI bean at application startup
ja_jp: `@Startup` を使用して、アプリケーション起動時に CDI Bean を初期化する

source: Using `@TransactionScoped` to bind CDI beans to the transaction lifecycle
ja_jp: `@TransactionScoped` を使用し、CDI Bean をトランザクションライフサイクルにバインド

source: Using `HttpServerRequest` and `HttpServerResponse` in Spring Web-style exception handlers
ja_jp: Spring Web スタイルの例外ハンドラーにおける `HttpServerRequest` と `HttpServerResponse` の使用

source: Using `InterceptionProxy` in synthetic beans is similar.
ja_jp: 合成 Bean で `InterceptionProxy` を使用する場合も同様です。

source: Using `JsonWebTokenRequestFilter` is recommended if you work with Bearer JWT tokens where these tokens can have their claims such as `issuer` and `audience` modified and the updated tokens secured (for example, re-signed) again. It expects an injected `org.eclipse.microprofile.jwt.JsonWebToken` and therefore will not work with the opaque tokens. Also, if your OpenID Connect Provider supports a Token Exchange protocol then it is recommended to use `AccessTokenRequestFilter` instead - as both JWT and opaque bearer tokens can be securely exchanged with `AccessTokenRequestFilter`.
ja_jp: `JsonWebTokenRequestFilter` の使用は、ベアラー JWT トークンで作業する場合に推奨されます。これらのトークンは `issuer` や `audience` などのクレームを変更し、更新されたトークンを再度保護 (再署名など) することができます。注入された `org.eclipse.microprofile.jwt.JsonWebToken` を想定しているため、不透明なトークンでは機能しません。また、OpenID Connect プロバイダーが Token Exchange プロトコルをサポートしている場合は、代わりに `AccessTokenRequestFilter` を使用することが推奨されます。JWT と不透明なベアラートークンの両方を `AccessTokenRequestFilter` と安全に交換することができるからです。

source: Using `JsonWebTokenRequestFilter` is recommended if you work with Bearer JWT tokens where these tokens can have their claims, such as `issuer` and `audience` modified and the updated tokens secured (for example, re-signed) again. It expects an injected `org.eclipse.microprofile.jwt.JsonWebToken` and, therefore, will not work with the opaque tokens. Also, if your OpenID Connect Provider supports a Token Exchange protocol, then it is recommended to use `AccessTokenRequestFilter` instead - as both JWT and opaque bearer tokens can be securely exchanged with `AccessTokenRequestFilter`.
ja_jp: `JsonWebTokenRequestFilter` の使用は、Bearer JWT トークンを扱う場合に推奨します。これらのトークンは `issuer` や `audience` などのクレームを変更でき、更新したトークンを再度セキュア (例: 再署名) に保つことができます。これは注入された `org.eclipse.microprofile.jwt.JsonWebToken` を想定しているため、不透明なトークンでは動作しません。また、OpenID Connect プロバイダーが Token Exchange プロトコルをサポートしている場合は、代わりに `AccessTokenRequestFilter` を使用することを推奨します。JWT と不透明な bearer トークンの両方を `AccessTokenRequestFilter` で安全に交換できます。

source: Using `JsonWebTokenRequestFilter` is recommended if you work with Bearer JWT tokens whose claims, such as `issuer` and `audience`, can be modified and the updated tokens re-secured, for example, re-signed.
ja_jp: `JsonWebTokenRequestFilter` は、`issuer` や `audience` などのクレームが変更され、更新されたトークンが再署名などの方法で再保護される Bearer JWT トークンを扱う場合に推奨されます。

source: Using `NodePort` as `Service` type
ja_jp: `Service` のtypeとして `NodePort` を使用

source: Using `OidcClient` to support the `authorization code` grant might be required if for some reasons you can not use the xref:security-openid-connect-web-authentication.adoc[Quarkus OpenID Connect extension] to support Authorization Code Flow. If there is a very good reason for you to implement Authorization Code Flow then you can configure `OidcClient` as follows:
ja_jp: 何らかの理由で xref:security-openid-connect-web-authentication.adoc[Quarkus OpenID Connect extension] を使用して認可コードフローをサポートできない場合は、 `OidcClient` を使用した `authorization code` グラントのサポートが必要な場合があります。認可コードフローを実装する正当な理由がある場合は、 `OidcClient` を以下のように設定することができます。
